class Docs:
    default = """
:shrimp:새우 봇의 명령어 입니다!
새우야 도움말 <명령어>로 상세히 볼 수 있습니다!

**새우야**
새우 봇이 온라인인지 확인합니다!

**도움말**
새우 봇의 명령어를 알려줍니다!

**밥**
GSM의 급식을 알려줍니다!

**초대**
새우 봇을 초대할 수 있는 링크를 줍니다!

**커스텀**
새우 봇에게 새로운 명령어를 추가합니다!

**청소**
새우 봇이 채널에 있는 메시지를 청소합니다!

**밀어버려**
새우 봇이 채널을 지우고 새롭게 생성해줍니다!
"""

    ping = """

새우 봇이 온라인인지 확인합니다!
그리고 반갑게 인사:wave: 해줍니다!

사용법 예시: `새우야`, `ㅎㅇ`, `안녕`
"""

    help = """

새우 봇의 명령어를 알려줍니다!
`새우야 도움말 <명령어>`를 통해 상세히 볼 수 있습니다!

사용법 예시: `새우야 도움말`, `새우야 명령어`, `새우야 help`
"""

    hungry = """

GSM의 급식을 알려줍니다!
앞에 새우야를 붙이지 않아도 작동합니다! (밥은 예외)

사용법 예시: `새우야 밥`, `새우야 배고파`, `qorhvk`, `헝그리`
"""

    invite_link = """

새우 봇을 초대할 수 있는 링크를 줍니다!
새우 봇은 15초후 초대 링크를 가지고 달아납니다!

사용법 예시: `새우야 초대`
"""

    custom = """

새우 봇에게 새로운 명령어를 추가합니다!

`새우야 커맨드 추가 <명령어> <대답할 메시지>`를 통해 추가합니다!
`새우야 커맨드 삭제 <명령어>`를 통해 등록된 명령어를 모두 삭제합니다!
`새우야 커맨드 목록`은 서버에 등록된 명령어를 알려줍니다!

사용법 예시: `새커추 새우 새우는 맛있어!`, `새커삭 새우`, `새커목`
"""

    flush_channel = """

새우 봇이 채널을 지우고 새롭게 생성해줍니다!

이 기능을 사용하려면 채널 관리 권한이 필요합니다!

사용법 예시: `새우야 밀어버려`
"""

    clean_messages = """

새우 봇이 채널에 있는 메시지를 청소합니다!

이 기능을 사용하려면 메시지 관리 권한이 필요합니다!

`새우야 청소 <삭제할 메시지 개수>`를 통해 사용할 수 있습니다!
메시지 개수를 입력하지 않으면 10개를 삭제합니다!

사용법 예시: `새우야 청소`, `새우야 청소 20`
"""
